MsgBox, Авто КлавоГонки v1.0 (Цифры)`n`nСкрипт был написан в целях демонстрации работы AutoHotKey, без злых умыслов и целей обманной игры. Автор не отвечает за использование скрипта пользователями и не оставляет за собой авторских прав. Создано на telegram.me/AutoHotKey`n`nКак пользоваться:`n• Запустите игру "Цифры" в клавогонках`n• Дождитесь появления текста`n• Нажмите Ctrl+P (печать) и скопируйте текст`n• Нажмите Alt+X`n• Вставьте текст и нажмите Enter`n• Вернитесь в игру, кликните по полю для ввода и нажмите Alt+C`n• ???`n• Закройте скрипт и играйте честно!`n`nЖмите OK и пробуйте.


;!vk58::
;Run, notepad.exe
;KeyWait, enter, D
;Send, ^{a}
;Send, ^{c}
Work = 1765,09 62 0 1 314 6 3 828 877 9 394 44 0776 30 5 99,7 6 45 2395 02 57 029,6 92 4 09 00,80 5995 9 8666 469 628 2759 2750 735,38 5,2 18 7379 773 9653 4 4189 806,6 043 8,36 58,2 26 7,59 50 1 1096 934 846 009 0 68 5 1,5 6,4 55 172,7 1639 375,0 9 0,07 2529 33,5 0 53 68 11 3 74 60 08 2883,27 9081 6231,13 037,30 0 0 85 1638 6869,68 16,1 1765,09 62 0 1 314 6 3 828 877 9 394 44 0776 30 5 99,7 6 45 2395 02 57 029,6 92 4 09 00,80 5995 9 8666 469 628 2759 2750 735,38 5,2 18 7379 773 9653 4 4189 806,6 043 8,36 58,2 26 7,59 50 1 1096 934 846 009 0 68 5 1,5 6,4 55 172,7 1639 375,0 9 0,07 2529 33,5 0 53 68 11 3 74 60 08 2883,27 9081 6231,13 037,30 0 0 85 1638 6869,68 16,1 1765,09 62 0 1 314 6 3 828 877 9 394 44 0776 30 5 99,7 6 45 2395 02 57 029,6 92 4 09 00,80 5995 9 8666 469 628 2759 2750 735,38 5,2 18 7379 773 9653 4 4189 806,6 043 8,36 58,2 26 7,59 50 1 1096 934 846 009 0 68 5 1,5 6,4 55 172,7 1639 375,0 9 0,07 2529 33,5 0 53 68 11 3 74 60 08 2883,27 9081 6231,13 037,30 0 0 85 1638 6869,68 16,1 1765,09 62 0 1 314 6 3 828 877 9 394 44 0776 30 5 99,7 6 45 2395 02 57 029,6 92 4 09 00,80 5995 9 8666 469 628 2759 2750 735,38 5,2 18 7379 773 9653 4 4189 806,6 043 7784 5 066 345 31 3763 9074,1 092 565,74 5,50 0,4 1566 7,09 280 0540 48 8 71 92,53 0 8 66 4374 4501 710 071 41 75 70 2 281,72 8 7 6948,8 763 579 6 6 92 366 072 6 5 8,4 1 8 051 4782 5 58 3427 7729 193 1,1 8396 1 762 269 84 21,31 084 6 1965 2955,4 6471,6 208 11 817 87 631 246 5992 790,86 7202,72 3614 7489 3,3 09 53.
StringReplace, Work, Work, % "`n", % "{space}", all
StringReplace, Work, Work, % " ",  % "{space}", all
StringReplace, Work, Work, % " ",  % "{space}", all
;Return

!vk43::
Loop 3 {
  SetKeyDelay, 25
  Send, %work%
  Sleep, 3000
  Send, ^{Right}
  Sleep, 10000
}
Return